{
  "translation": {
    "nav": {
      "home": "Home",
      "experience": "Experience",
      "skills": "Skills",
      "projects": "Projects",
      "education": "Education",
      "contact": "Contact"
    },
    "home": {
      "greeting": "Hi, I'm",
      "role": "I'm a",
      "typing_roles": [
        "Web Developer",
        1500,
        "Developer",
        1500,
        "Programmer Analyst",
        1500,
        "Software Developer",
        1500
      ],
      "description": "Hello, I am a Software Engineer and Startup Founder with proven experience building scalable web applications and AI-driven platforms. Track record of modernizing financial systems using .NET and architecting SaaS solutions with Next.js and Cloud technologies.",
      "cv_button": "Resume"
    },
    "experience": {
      "title": "Experience",
      "jobs": [
        {
          "title": "FULL STACK DEVELOPER",
          "company": "DIMENSION",
          "date": "June 2025 - Present",
          "description": [
            "Developed and optimized high-performance RESTful APIs using .NET Core and C#, managing critical business logic for the factoring financial system.",
            "Designed relational database architectures in SQL Server, creating stored procedures and complex functions to improve response times for massive data queries.",
            "Implemented dynamic interfaces and client-side logic using pure JavaScript (ES6+), maximizing browser performance by reducing dependency on external libraries.",
            "Collaborated in an Agile team to deliver robust features, ensuring transactional data integrity and enhancing the end-user experience in critical operations."
          ]
        },
        {
          "title": "FULL STACK DEVELOPER",
          "company": "Nomed",
          "date": "March 2025 - June 2025",
          "description": [
            "Built modern, responsive web applications utilizing Vue.js and Tailwind CSS, focusing on reusable component architecture and UX/UI best practices.",
            "Managed containerized environments using Docker and deployed scalable infrastructure on AWS, ensuring high availability for production services.",
            "Designed and implemented automated workflows by integrating third-party APIs with n8n, significantly reducing the team's manual operational load.",
            "Developed robust backend services using Laravel (PHP), creating secure and optimized endpoints for frontend consumption."
          ]
        }
      ]
    },

    "skills": {
      "title": "Skills",
      "languages": "Languages",
      "frameworks": "Frameworks",
      "tools": "Tools"
    },
    "projects": {
      "title": "Projects",
      "mecanografia": {
        "title": "Typing Game",
        "description": "This is a typing game made with pure JavaScript without frameworks."
      },
      "balotario": {
        "title": "Ballot DEMO",
        "description": "I developed a demo of a ballot system with Django for a maritime company (DICAPI), where questions are dynamically loaded from a JSON file and presented randomly to the user. The system allows two evaluation modes: a learning mode, with no time restrictions, and a drill mode, which incorporates a timed stopwatch to simulate real conditions. Upon completion, a statistical summary with the user's results is generated, facilitating performance analysis. The application is designed with a focus on usability and efficient data handling in the backend. This website is not official; it is for practice purposes only."
      },
      "conversor": {
        "title": "Currency Converter",
        "description": "Web application that converts currencies in real-time using the ExchangeRate-API. It fetches conversion values and displays them in a modern, responsive interface developed with HTML, CSS, and JavaScript."
      }
    },
    "education": {
      "title": "Education",
      "institution": "DuocUC",
      "date": "2023 - Present",
      "description": "Computer Engineering student currently in the 5th semester, holding a \"Computational Programmer Analyst\" technical degree."
    },
    "contact": {
      "title": "Contact",
      "email": "Email",
      "phone": "Phone"
    },
    "footer": {
      "created_by": "Designed & Built by Ignacio Andrade"
    }
  }
}