{
  "translation": {
    "nav": {
      "home": "Menú",
      "experience": "Experiencia",
      "skills": "Habilidades",
      "projects": "Proyectos",
      "education": "Educación",
      "contact": "Contacto"
    },
    "home": {
      "greeting": "Hola, soy",
      "role": "Soy un",
      "typing_roles": [
        "Desarrollador Web",
        1500,
        "Developer",
        1500,
        "Analista Programador",
        1500,
        "Desarrollador de Software",
        1500
      ],
      "description": "Desarrollador FullStack y Fundador de Startup con experiencia en el desarrollo de aplicaciones web escalables y plataformas de IA. Experiencia demostrable modernizando sistemas financieros con .NET y arquitectando soluciones SaaS con Next.js y tecnologías Cloud.",
      "cv_button": "CV"
    },
    "experience": {
      "title": "Experiencia",
      "jobs": [
        {
          "title": "Programador",
          "company": "DIMENSION",
          "date": "Junio 2025 - Actualidad",
          "description": [
            "Desarrollé y optimicé APIs RESTful de alto rendimiento con .NET Core y C#, administrando la lógica de negocio esencial para el sistema de factoring.",
            "Diseñé arquitecturas de bases de datos relacionales en SQL Server, generando procedimientos almacenados y funciones complejas para mejorar los tiempos de respuesta en consultas masivas.",
            "Implementé interfaces dinámicas y lógica del cliente utilizando JavaScript (ES6+) puro.",
            "Colaboré en un equipo Ágil para entregar funcionalidades sólidas, garantizando la integridad transaccional de los datos y enriqueciendo la experiencia del usuario final."
          ]        
        },
        {
          "title": "Junior Software Developer",
          "company": "Nomed",
          "date": "Marzo 2025 - Junio 2025",
          "description": [
            "Construí aplicaciones web modernas y responsivas utilizando Vue.js y Tailwind CSS, enfocándome en la arquitectura de componentes reutilizables y mejores prácticas de UX/UI.",
            "Gestioné entornos contenerizados usando Docker y desplegué infraestructura escalable en AWS, asegurando la alta disponibilidad de los servicios en producción.",
            "Diseñé e implementé automatizaciones de flujo de trabajo (Workflows) integrando APIs de terceros con n8n, reduciendo significativamente la carga operativa manual del equipo.",
            "Desarrollé el backend utilizando Laravel (PHP), creando endpoints seguros y optimizados para el consumo del frontend."
          ]        }
      ]
    },

    "skills": {
      "title": "Habilidades",
      "languages": "Lenguajes",
      "frameworks": "Frameworks",
      "tools": "Herramientas"
    },
    "projects": {
      "title": "Proyectos",
      "mecanografia": {
        "title": "Mecanografía",
        "description": "Este es un juego de mecanografía hecho con JavaScript puro sin frameworks."
      },
      "balotario": {
        "title": "Balotario DEMO",
        "description": "Desarrollé una demo de un sistema de balotario con Django para una empresa marítima (DICAPI), en el cual las preguntas se cargan dinámicamente desde un archivo JSON y se presentan de forma aleatoria al usuario. El sistema permite dos modos de evaluación: un modo aprendizaje, sin restricciones de tiempo, y un modo simulacro, que incorpora un cronómetro con tiempo límite para simular condiciones reales. Al finalizar, se genera un resumen estadístico con los resultados del usuario, facilitando el análisis del desempeño. La aplicación está diseñada con enfoque en usabilidad y manejo eficiente de datos en el backend, esta web no es oficial, es solamente para temas de practica."
      },
      "conversor": {
        "title": "Conversor de divisas",
        "description": "Aplicación web que convierte monedas en tiempo real usando la API de ExchangeRate-API. Obtiene los valores de conversión y los muestra en una interfaz moderna y responsiva, desarrollada con HTML, CSS y JavaScript."
      }
    },
    "education": {
      "title": "Educación",
      "institution": "DuocUC",
      "date": "2023 - Actualmente",
      "description": "Estudiante de ingenieria Informatica actualmente cursando el 5to semestre y contando con el tecnico \"Analista Programador Computacional\""
    },
    "contact": {
      "title": "Contacto",
      "email": "Correo",
      "phone": "N° Telefónico"
    },
    "footer": {
      "created_by": "Diseñado y construido por Ignacio Andrade"
    }
  }  
}
